# Напишите функцию `add_2`, которая будет возвращать значение своего аргумента
# увеличенное на 2
def add_2(a = 3):
    return a + 2

print(add_2(a=3))