# Задание 2 (I). Напишите функцию `add_2`, которая будет возвращать значение своего аргумента
# увеличенное на 2
# Вход: 3
# Выход: 5

def add_2(a): return a + 2


print(add_2(3))



